[Survived] BooleanLiteral
src/game/gameHerve.ts:3:25
 // @ts-nocheck
 class GameResult {
-    isWinner: boolean = false;
+    isWinner: boolean = true;
     winner: string = '';
 }

[Survived] ArrayDeclaration
src/game/gameHerve.ts:11:35
     private _columns: number = 0;
     private _rows: number = 0;
     private _winningStreak: number = 0;
-    private _matrix: string[][] = [];
+    private _matrix: string[][] = ["Stryker was here"];
 
 

[Killed] BlockStatement
src/game/gameHerve.ts:14:49
     private _matrix: string[][] = [];
 
 
-    setDimensions(rows: number, column: number) {
-        this._columns = column;
-        this._rows = rows;
-        this._matrix = Array(rows).fill(null).map(() => Array(column).fill('_'));
-    }
+    setDimensions(rows: number, column: number) {}
 
     setWinningStreak(winningStreak: number) {
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: TypeError: Cannot read properties of undefined (reading 'reduce')

[Killed] ArrowFunction
src/game/gameHerve.ts:17:51
     setDimensions(rows: number, column: number) {
         this._columns = column;
         this._rows = rows;
-        this._matrix = Array(rows).fill(null).map(() => Array(column).fill('_'));
+        this._matrix = Array(rows).fill(null).map(() => undefined);
     }
 
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] ArrayDeclaration
src/game/gameHerve.ts:17:57
     setDimensions(rows: number, column: number) {
         this._columns = column;
         this._rows = rows;
-        this._matrix = Array(rows).fill(null).map(() => Array(column).fill('_'));
+        this._matrix = Array(rows).fill(null).map(() => Array().fill('_'));
     }
 
killedBy: Parametrized game tests with grid size 2x2 empty line is not winning
statusReason: TypeError: Reduce of empty array with no initial value

[Survived] BlockStatement
src/game/gameHerve.ts:20:45
         this._matrix = Array(rows).fill(null).map(() => Array(column).fill('_'));
     }
 
-    setWinningStreak(winningStreak: number) {
-        this._winningStreak = winningStreak;
-    }
+    setWinningStreak(winningStreak: number) {}
 
 

[Killed] BlockStatement
src/game/gameHerve.ts:25:57
     }
 
 
-    fillFullLine(rowNumber: number, tileSymbol: string) {
-        for (let col = 0; col < this._columns; col++) {
-            this._matrix[rowNumber][col] = tileSymbol;
-        }
-    }
+    fillFullLine(rowNumber: number, tileSymbol: string) {}
 
     fillFullColumn(colNumber: number, symbol: string) {
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/game/gameHerve.ts:26:27
 
 
     fillFullLine(rowNumber: number, tileSymbol: string) {
-        for (let col = 0; col < this._columns; col++) {
+        for (let col = 0; false; col++) {
             this._matrix[rowNumber][col] = tileSymbol;
         }
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/game/gameHerve.ts:26:55
 
 
     fillFullLine(rowNumber: number, tileSymbol: string) {
-        for (let col = 0; col < this._columns; col++) {
-            this._matrix[rowNumber][col] = tileSymbol;
-        }
+        for (let col = 0; col < this._columns; col++) {}
     }
 
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/game/gameHerve.ts:31:55
         }
     }
 
-    fillFullColumn(colNumber: number, symbol: string) {
-        for (let row = 0; row < this._rows; row++) {
-            this._matrix[row][colNumber] = symbol;
-        }
-    }
+    fillFullColumn(colNumber: number, symbol: string) {}
 
     VerifyLine(rowNumber: number): GameResult {
killedBy: Parametrized game tests with symbol X column 0 filled is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/game/gameHerve.ts:32:52
     }
 
     fillFullColumn(colNumber: number, symbol: string) {
-        for (let row = 0; row < this._rows; row++) {
-            this._matrix[row][colNumber] = symbol;
-        }
+        for (let row = 0; row < this._rows; row++) {}
     }
 
killedBy: unknown game column one is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] UpdateOperator
src/game/gameHerve.ts:32:45
     }
 
     fillFullColumn(colNumber: number, symbol: string) {
-        for (let row = 0; row < this._rows; row++) {
+        for (let row = 0; row < this._rows; row--) {
             this._matrix[row][colNumber] = symbol;
         }
killedBy: Parametrized game tests with symbol X column 0 filled is winning
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] BlockStatement
src/game/gameHerve.ts:37:47
         }
     }
 
-    VerifyLine(rowNumber: number): GameResult {
-        let result = new GameResult();
-        let winningSymbol = this.containsOnlyTheSameSymbol(this.readMatrixLine(rowNumber));
-        result.isWinner = winningSymbol;
-        result.winner = this.readMatrixLine(rowNumber)[0]  ;
-        return result;
-    }
+    VerifyLine(rowNumber: number): GameResult {}
         //TODO: remove duplicate code (DRY)
     VerifyColumn(columnNumber: number) {
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: TypeError: Cannot read properties of undefined (reading 'isWinner')

[Killed] BlockStatement
src/game/gameHerve.ts:53:58
         return result;
     }
 
-    containsOnlyTheSameSymbol(fullLine: string): boolean {
-        return fullLine.split('').reduce((acc, curr, idx) => {
-            if (idx === 0) return curr !== '_'; // First char must not be empty
-            return acc && curr === fullLine[0]; // All must match first char
-        }, true);
-    }
+    containsOnlyTheSameSymbol(fullLine: string): boolean {}
 
 
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/game/gameHerve.ts:54:62
     }
 
     containsOnlyTheSameSymbol(fullLine: string): boolean {
-        return fullLine.split('').reduce((acc, curr, idx) => {
-            if (idx === 0) return curr !== '_'; // First char must not be empty
-            return acc && curr === fullLine[0]; // All must match first char
-        }, true);
+        return fullLine.split('').reduce((acc, curr, idx) => {}, true);
     }
 
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/game/gameHerve.ts:55:35
 
     containsOnlyTheSameSymbol(fullLine: string): boolean {
         return fullLine.split('').reduce((acc, curr, idx) => {
-            if (idx === 0) return curr !== '_'; // First char must not be empty
+            if (idx === 0) return curr === '_'; // First char must not be empty
             return acc && curr === fullLine[0]; // All must match first char
         }, true);
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/game/gameHerve.ts:55:17
 
     containsOnlyTheSameSymbol(fullLine: string): boolean {
         return fullLine.split('').reduce((acc, curr, idx) => {
-            if (idx === 0) return curr !== '_'; // First char must not be empty
+            if (false) return curr !== '_'; // First char must not be empty
             return acc && curr === fullLine[0]; // All must match first char
         }, true);
killedBy: Parametrized game tests with grid size 2x2 empty line is not winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/game/gameHerve.ts:56:20
     containsOnlyTheSameSymbol(fullLine: string): boolean {
         return fullLine.split('').reduce((acc, curr, idx) => {
             if (idx === 0) return curr !== '_'; // First char must not be empty
-            return acc && curr === fullLine[0]; // All must match first char
+            return acc || curr === fullLine[0]; // All must match first char
         }, true);
     }
killedBy: Parametrized game tests with grid size 2x2 empty line is not winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/game/gameHerve.ts:56:27
     containsOnlyTheSameSymbol(fullLine: string): boolean {
         return fullLine.split('').reduce((acc, curr, idx) => {
             if (idx === 0) return curr !== '_'; // First char must not be empty
-            return acc && curr === fullLine[0]; // All must match first char
+            return acc && curr !== fullLine[0]; // All must match first char
         }, true);
     }
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
src/game/gameHerve.ts:57:12
         return fullLine.split('').reduce((acc, curr, idx) => {
             if (idx === 0) return curr !== '_'; // First char must not be empty
             return acc && curr === fullLine[0]; // All must match first char
-        }, true);
+        }, false);
     }
 

[Killed] BlockStatement
src/game/gameHerve.ts:61:47
     }
 
 
-    readMatrixLine(rowNumber: number): string {
-        return this._matrix[rowNumber].reduce((acc, curr) => acc + curr);
-    }
+    readMatrixLine(rowNumber: number): string {}
     //TODO: remove duplicate code (DRY)
     readMatrixColumn(colNumber: number): string {
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ArrowFunction
src/game/gameHerve.ts:62:47
 
 
     readMatrixLine(rowNumber: number): string {
-        return this._matrix[rowNumber].reduce((acc, curr) => acc + curr);
+        return this._matrix[rowNumber].reduce(() => undefined);
     }
     //TODO: remove duplicate code (DRY)
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ArithmeticOperator
src/game/gameHerve.ts:62:62
 
 
     readMatrixLine(rowNumber: number): string {
-        return this._matrix[rowNumber].reduce((acc, curr) => acc + curr);
+        return this._matrix[rowNumber].reduce((acc, curr) => acc - curr);
     }
     //TODO: remove duplicate code (DRY)
killedBy: Parametrized game tests with symbol X row 0 filled is winning
statusReason: TypeError: fullLine.split is not a function

[Killed] BlockStatement
src/game/gameHerve.ts:65:49
         return this._matrix[rowNumber].reduce((acc, curr) => acc + curr);
     }
     //TODO: remove duplicate code (DRY)
-    readMatrixColumn(colNumber: number): string {
-        return this._matrix.reduce((acc, row) => acc + row[colNumber], '');
-    }
+    readMatrixColumn(colNumber: number): string {}
 
     setTile(row: number, column: number, symbol: string) {
killedBy: readMatrixColumn empty column returns ___
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "___"
Received: undefined

[Killed] ArrowFunction
src/game/gameHerve.ts:66:36
     }
     //TODO: remove duplicate code (DRY)
     readMatrixColumn(colNumber: number): string {
-        return this._matrix.reduce((acc, row) => acc + row[colNumber], '');
+        return this._matrix.reduce(() => undefined, '');
     }
 
killedBy: Parametrized game tests with symbol X column 0 filled is winning
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ArithmeticOperator
src/game/gameHerve.ts:66:50
     }
     //TODO: remove duplicate code (DRY)
     readMatrixColumn(colNumber: number): string {
-        return this._matrix.reduce((acc, row) => acc + row[colNumber], '');
+        return this._matrix.reduce((acc, row) => acc - row[colNumber], '');
     }
 
killedBy: Parametrized game tests with symbol X column 0 filled is winning
statusReason: TypeError: fullLine.split is not a function

[Killed] BlockStatement
src/game/gameHerve.ts:69:58
         return this._matrix.reduce((acc, row) => acc + row[colNumber], '');
     }
 
-    setTile(row: number, column: number, symbol: string) {
-        this._matrix[row][column] = symbol;
-    }
+    setTile(row: number, column: number, symbol: string) {}
 
 
killedBy: Parametrized game tests mixed symbols: X and O line with both symbols is not winning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
